<?php

function work_method($m) {
	switch ($m) {
		case 0: return 'ไม่ระบุ';
		case 1: return 'จัดซื้อจัดจ้าง';
		case 2: return 'ให้ทุน';
		case 3: return 'ร่วมโครงการ';
		case 4: return 'ร่วมทุน';
		case 5: return 'ดำเนินการเอง';
	}
}

// report
function result_env($s) {
	if ($s<1.5) return 'ต้องปรับปรุงโดยเร่งด่วน';
	if ($s<2.5) return 'ควรปรับปรุง';
	if ($s<3.5) return 'ปานกลาง';
	if ($s<4.5) return 'ดี';
	return 'ดีมาก';
	
	/*if ($s<=1.4) return 'ต้องปรับปรุงโดยเร่งด่วน';
	if ($s<=2.4) return 'ควรปรับปรุง';
	if ($s<=3.4) return 'ปานกลาง';
	if ($s<=4.4) return 'ดี';
	return 'ดีมาก';	*/
}

function envi($t) {
	switch ($t) {
		case 1: return '1. สภาพแวดล้อมการควบคุม (Control Environment)';
		case 2: return '2. การประเมินความเสี่ยง (Risk Assessment)'; 
		case 3: return '3. กิจกรรมการควบคุม (Control Activities)';
		case 4: return '4. สารสนเทศและการสื่อสาร (Information & Communication)';
		case 5: return '5. การติดตาม (Monitoring)';
	}	
}
// end report

// include
function level_frequency($v) {
	switch ($v) {
		case 1: return 'มีโอกาสเกิดน้อยกว่า 1% / 5 ปีต่อครั้ง';
		case 2: return 'มีโอกาสเกิด 1.01-5% / 2-3 ปีต่อครั้ง';
		case 3: return 'มีโอกาสเกิด 5.01-10% / 1 ปีต่อครั้ง';
		case 4: return 'มีโอกาสเกิด 10.01-15% / 1-6 เดือนต่อครั้ง แต่ไม่เกิน 5 ครั้ง';
		case 5: return 'มีโอกาสเกิดมากกว่า 15% / 1 เดือนต่อครั้งหรือมากกว่า';
	}
}

function level_value($v) {
	switch ($v) {
		case 1: return 'น้อยมาก';
		case 2: return 'น้อย';
		case 3: return 'ปานกลาง';
		case 4: return 'สูง';
		case 5: return 'สูงมาก';
	}
}

function test_env_report($s) {
	if ($s<1.5) return 'ต้องปรับปรุงโดยเร่งด่วน';
	if ($s<2.5) return 'ควรปรับปรุง';
	if ($s<3.5) return 'ปานกลาง';
	if ($s<4.5) return 'ดี';
	return 'ดีมาก';
	
	/*if ($s<=1.4) return 'ต้องปรับปรุงโดยเร่งด่วน';
	if ($s<=2.4) return 'ควรปรับปรุง';
	if ($s<=3.4) return 'ปานกลาง';
	if ($s<=4.4) return 'ดี';
	return 'ดีมาก';
	/*if ($s<=0.7) return 'ต้องปรับปรุงโดยเร่งด่วน';
	if ($s<=1.2) return 'ควรปรับปรุง';
	if ($s<=1.7) return 'ปานกลาง';
	if ($s<=2.2) return 'ดี';
	return 'ดีมาก';*/
}

function test_env($s) {
	if ($s<=0.7) return 'ต้องปรับปรุงโดยเร่งด่วน';
	if ($s<=1.2) return 'ควรปรับปรุง';
	if ($s<=1.7) return 'ปานกลาง';
	if ($s<=2.2) return 'ดี';
	return 'ดีมาก';
}

function test_env2_report($s) {
	if ($s<1.5) return 0;
	if ($s<2.5) return 1;
	if ($s<3.5) return 2;
	if ($s<4.5) return 3;
	return 4;
	
	/*if ($s<=0.7) return 0;
	if ($s<=1.2) return 1;
	if ($s<=1.7) return 2;
	if ($s<=2.2) return 3;
	return 4;	*/
	
	/*if ($s<=1.4) return 0;
	if ($s<=2.4) return 1;
	if ($s<=3.4) return 2;
	if ($s<=4.4) return 3;
	return 4;	*/
	/*if ($s<=1.4) return 1;
	if ($s<=2.4) return 2;
	if ($s<=3.4) return 3;
	if ($s<=4.4) return 4;
	return 5;*/
}

function test_env2($s) {
	if ($s<=0.7) return 0;
	if ($s<=1.2) return 1;
	if ($s<=1.7) return 2;
	if ($s<=2.2) return 3;
	return 4;
}

function control_approach ($t) {
	switch ($t) {
		case 1: return 'ยอมรับความเสี่ยง (ACCEPT/Take)';
		case 2: return 'ลดความเสี่ยง (REDUCTION/Treat)';
		case 3: return 'หลีกเลี่ยงความเสี่ยง (AVOID/Terminate)';
		case 4: return 'โอนย้ายความเสี่ยง (SHARING/transfer)';
	}
}

function control_approach_full ($t) {
	switch ($t) {
		case 1: return 'การยอมรับความเสี่ยงที่เกิดขึ้น (ACCEPT/Take)';
		case 2: return 'การลด/การควบคุมความเสี่ยง (REDUCTION/Treat) เช่น แผนจัดการความเสี่ยง หรือการปรับปรุงระบบการทำงาน';
		case 3: return 'หลีกเลี่ยงความเสี่ยง (AVOID/Terminate)';
		case 4: return 'การถ่ายโอนความเสี่ยงให้ผู้อื่นช่วยแบ่งความรับผิดชอบ (SHARING/transfer) เช่น ทำประกัน จ้างผู้ให้บริการภายนอก';
	}
}

function level_acceptable($t) {
	switch ($t) {
		case 1: return 'เกิดข้อผิดพลาดไม่เกิน 5% ของเรื่องที่ต้องการวัด';
		case 2: return 'ระบบงานขัดข้องไม่สามารถปฏิบัติงานได้ ไม่เกิน 1 ชั่วโมง';
		case 3: return 'ระบุเพิ่มเติมจากที่กำหนดข้างต้น';
	}
}

function level_alert($t) {
	switch ($t) {
		case 1: return 'เกิดข้อผิดพลาด 5.01 - 10.01 % ของเรื่องที่ต้องการวัด';
		case 2: return 'ระบบงานขัดข้องไม่สามารถปฏิบัติงานได้ มากกว่า 1 - 4 ชั่วโมง';
		case 3: return 'ระบุเพิ่มเติมจากที่กำหนดข้างต้น';
	}
}

function level_problem($t) {
	switch ($t) {
		case 1: return 'เกิดข้อผิดพลาดตั้งแต่ 10.01 % ขึ้นไป';
		case 2: return 'ระบบงานขัดข้องไม่สามารถปฏิบัติงานได้ มากกว่า 8 ชั่วโมงขึ้นไป';
		case 3: return 'ระบุเพิ่มเติมจากที่กำหนดข้างต้น';
	}
}

function factor_int ($t) {
	switch ($t) {
		case 1: return 'ด้านกลยุทธ์และการแข่งขัน';
		case 2: return 'ด้านการเงิน';
		case 3: return 'ด้านการดำเนินการ';
		case 4: return 'ด้านทรัพยากรบุคคล';
	}
}

function factor_ext ($t) {
	switch ($t) {
		case 1: return 'ด้านพันธมิตร';
		case 2: return 'ด้านกฎระเบียบข้อกฎหมาย';
		case 3: return 'ด้านเศรษฐกิจ นโยบาย การเมือง';
	}
}

function risk_event ($t) {
	switch ($t) {
		case 1: return 'การขาดความเข้าใจร่วมกันเกี่ยวกับเป้าหมายที่โครงการต้องการดำเนินการให้บรรลุผลสำเร็จ';
		case 2: return 'การขาดความชัดเจนเกี่ยวกับผลลัพธ์พึงประสงค์จากโครงการ';
		case 3: return 'การขาดรายละเอียดของผู้ที่จะได้รับผลประโยชน์จากโครงการ และการเข้าถึงผลผลิตของ';
		case 4: return 'การขาดการรับรู้ว่า ถึงความสำเร็จของโครงการต่อองค์กร';
		case 5: return 'การขาดการเตรียมการและความพร้อมในการเปลี่ยนแปลงวิธีการทำงานของบุคคล';
		case 6: return 'การที่ไม่ได้เกิดการปรับตัวภายในองค์กรเพื่ออำนวยความสะดวกในการดำเนินโครงการ';
		case 7: return 'ความไม่ลงรอยกันหรือความล่าช้าของการตัดสินใจกรณีที่ผู้บริหารที่สนับสนุนโครงการมีมากกว่า 2 คนขึ้นไป';
		case 8: return 'ขาดกิจกรรมการมีส่วนร่วมอย่างสร้างสรรค์และทั่วถึงของผู้ที่เข้าร่วมประชุม';
		case 9: return 'ไม่สามารถสร้างการรับรู้ถึงประโยชน์ที่จะเกิดกับผู้เข้าร่วมประชุมเกี่ยวกับตัวโครงการ';
		case 10: return 'ไม่มีความเข้าใจหรือรับรู้ชัดเจนเกี่ยวกับความคาดหวังขององค์กรต่อผู้มีส่วนร่วมในโครงการ ';
		case 11: return 'การสื่อสารทางเดียว ไม่ได้เปิดให้มีการแสดงหรือแลกเปลี่ยนความคิดเห็นจากผู้ที่ร่วมการประชุม เพื่อให้โครงการเป็นประโยชน์ต่อองค์กรมากที่สุด หรือแนวทางในการดำเนินงานโครงการให้ง่ายขึ้น หรือมีประสิทธิภาพมากขึ้น';
		case 12: return 'ผู้บริหารที่เป็นผู้สนับสนุนโครงการ ไม่ได้เข้าร่วมรับฟังหรือการตัดสินใจในการประชุมตามความจำเป็น';
		case 13: return 'เป็นการสื่อสารทางเดียว ไม่ได้เปิดให้มีการแสดงหรือแลกเปลี่ยนความคิดเห็นจากผู้ที่ร่วมการประชุม เพื่อให้โครงการเป็นประโยชน์ต่อองค์กรมากที่สุด หรือแนวทางในการดำเนินงานโครงการให้ง่ายขึ้น หรือมีประสิทธิภาพมากขึ้น';
		case 14: return 'ผู้บริหารที่เป็นผู้สนับสนุนโครงการ (Project Sponsor)  ไม่ได้เข้าร่วมรับฟังหรือการตัดสินใจในการประชุมตามความจำเป็น';
		case 15: return 'ผู้ที่ทำหน้าที่กำหนดกรอบตารางเวลาดำเนินโครงการขาดประสบการณ์ที่เพียงพอ';
		case 16: return 'ขาดข้อมูลกรอบเวลาการดำเนินงานโครงการในอดีตเพื่อประกอบการพิจารณากำหนดกรอบเวลาของโครงการที่กำลังจะดำเนินการพิจารณาในปีงบประมาณปัจจุบัน';
		case 17: return 'ผู้ที่ทำหน้าที่กำหนดกรอบตารางเวลาดำเนินโครงการขาดประสบการณ์ที่เพียงพอ';
		case 18: return 'ขาดข้อมูลกรอบเวลาการดำเนินงานโครงการในอดีตเพื่อประกอบการพิจารณากำหนดกรอบเวลาของโครงการที่กำลังจะดำเนินการพิจารณาในปีงบประมาณปัจจุบัน';
		case 19: return 'โครงการที่จะพิจารณาวางกรอบเวลาเป็นโครงการใหม่ที่ไม่คุ้นเคยหรือมีประสบการณ์มาก่อน';
		case 20: return 'เทคโนโลยีที่ใช้ในโครงการเป็นเทคโนโลยีใหม่ ซึ่งอาจจะมีผลให้ตารางเวลาดำเนินงานโครงการแตกต่างจากโครงการที่เคยใช้เทคโนโลยีเดิม เพราะต้องการเวลาในการเรียนรู้และศึกษาเกี่ยวกับเทคโนโลยีใหม่เพิ่มเติม';
		case 21: return 'ทีมงานที่ดำเนินโครงการเป็นทีมใหม่ที่ไม่มีบทเรียนหรือการเรียนรู้เกี่ยวกับตารางและเวลาในการดำเนินโครงการ';
		case 22: return 'การเริ่มต้นและสิ้นสุดโครงการขึ้นกับปัจจัยภายนอกที่อยู่นอกเหนือการควบคุมของผู้รับผิดชอบและทีมงานโครงการ';
		case 23: return 'ไม่สามารถสืบสาวย้อนหลังไปหาโครงการที่เคยดำเนินการมาแล้วเพื่อที่นำมาใช้เป็นข้อมูลพื้นฐานในการกำหนดตารางเวลาทำโครงการ';
		case 24: return 'สมมติฐานการวางตารางเวลาการดำเนินโครงการเป็นการมองโลกในแง่ดีเกินไป (Over-optimistic side)';
		case 25: return 'ขาดการทำการวิเคราะห์ความไวหรือความไหวตัว (Sensitivity Analysis) หรือการวิเคราะห์ฉากทัศน์ (Scenario Analysis) ก่อนการกำหนดตารางเวลาการดำเนินงานโครงการ';
		case 26: return 'การจัดตารางเวลาการดำเนินโครงการถูกจำกัดด้วยงบประมาณ และ/หรือทรัพยากรที่จะใช้ในการดำเนินโครงการ';
		case 27: return 'ไม่มีบรรทัดฐาน ค่าเฉลี่ยของอุตสาหกรรมหรือมาตรฐานเพื่อช่วยในการกำหนดตารางเวลาการดำเนินโครงการ';
		case 28: return 'ขาดการมีส่วนร่วมของผู้ที่มีความรู้ และการดำเนินการจัดตารางเวลาดำเนินโครง ดำเนินการโดยบุคลากรเพียงไม่กี่คน';
		case 29: return 'ขาดการสร้างบทเรียนความเสี่ยงจากโครงการที่ดำเนินการไปแล้วเพื่อใช้ในการเรียนรู้ซึ่งทำให้มีโอกาสที่จะผิดพลาดซ้ำๆ';
		case 30: return 'ขาดการแบ่งปันแลกเปลี่ยนแนวทางการจัดการความเสี่ยงโครงการที่เคยมีการใช้มาแล้วทำให้ขาดความเท่าเทียมกันในศักยภาพและความพร้อมในการจัดการกับความเสี่ยง';
		case 31: return 'ขาดข้อมูลความเสี่ยงและผลกระทบที่เกิดขึ้นจริงกับโครงการและองค์กร เพื่อจะได้กำหนดเกณฑ์ความเสี่ยงที่ยอมรับได้ และที่เกินกว่าเกณฑ์ที่ยอมรับได้';
		case 32: return 'การขาดความเข้าใจอย่างเพียงพอว่าการสื่อสารควรจะเกิดในช่วงเวลาใดของโครงการบ้าง';
		case 33: return 'ขาดความรู้ว่าประเด็นใดบ้างที่ควรจะมีการสื่อสารในโครงการ';
		case 34: return 'ขาดการสร้างความพร้อมและการปรับทัศนคติให้ทีมงานในโครงการรับข้อมูลจากการสื่อสารแบบเปิดใจกว้าง';
	}	
}

function risk_type ($t) {
	switch ($t) {
		case 1: return 'ความเสี่ยงด้านกลยุทธ์ (Strategic Risk)';
		case 2: return 'ความเสี่ยงด้านการปฏิบัติการ (Operational Risk)';
		case 3: return 'ความเสี่ยงด้านการเงินและรายงาน (Financial Risk)';
		case 4: return 'ความเสี่ยงด้านกฎหมาย กฎเกณฑ์ต่างๆ (Compliance Risk)';
		case 5: return 'การบริหารจัดการที่ดี (Good Governance)';
		case 6: return 'ความเสี่ยงด้านการเทคโนโลยีสารสนเทศ (Information Technology Risk)';
	}
}

function risk_category ($t) {
	switch ($t) {
		case 1: return 'การแข่งขันของตลาด';
		case 2: return 'การไม่เข้าใจความต้องการของลูกค้า';
		case 3: return 'นโยบายผิดพลาด';
		case 4: return 'การเมืองแทรกแซง';
		case 5: return 'บุคลากร - ความสามารถไม่เพียงพอ';
		case 6: return 'บุคลากร - ประมาทเลินเล่อ';
		case 7: return 'บุคลากร - ทุจริต';
		case 8: return 'บุคลากร - พึ่งพาบุคลากรหลัก';
		case 9: return 'การปฎบัติงาน - ความผิดพลาดจากวิธีการ';
		case 10: return 'การปฎบัติงาน - ความผิดพลาดจากการทำรายการ';
		case 11: return 'การปฎบัติงาน - การอนุมัติรายการ';
		case 12: return 'เทคโนโลยี - ระบบงานขัดข้อง';
		case 13: return 'เทคโนโลยี - ระบบการสื่อสารขัดข้อง';
		case 14: return 'เทคโนโลยี - ความปลอดภัยของข้อมูล';
		case 15: return 'เทคโนโลยี - Programming Error';
		case 16: return 'ปัจจัยภายนอก - การปฎิบัติไม่เป็นไปตามสัญญาของ Vendor';
		case 17: return 'ปัจจัยภายนอก - ภัยพิบัติต่างๆ';
		case 18: return 'ขาดสภาพคล่อง';
		case 19: return 'ขาดเครดิต';
		case 20: return 'อัตราดอกเบี้ยรับ และผลตอบแทนต่ำลง';
		case 21: return 'งบประมาณไม่เพียงพอ';
		case 22: return 'การปฎิบัติที่ผิดกฎหมาย ระเบียบ ข้อบังคับ';
		case 23: return 'การไม่ปฎิบัติตามมติ ครม.';
		case 24: return 'การไม่ปฎิบัติตามสัญญา';
	}
}

function regulation_status ($t) {
	switch ($t) {
		case 1: return 'เพียงพอ';
		case 2: return 'เพียงพอแต่ไม่ปฎิบัติตาม';
		case 3: return 'ไม่เพียงพอ';
	}
}

function manage_selected_method ($t) {
	switch ($t) {
		case 1: return 'ยอมรับความเสี่ยง (ACCEPT/Take)';
		case 2: return 'ลดความเสี่ยง (REDUCTION/Treat)';
		case 3: return 'หลีกเลี่ยงความเสี่ยง (AVOID/Terminate)';
		case 4: return 'โอนย้ายความเสี่ยง (SHARING/transfer)';
	}
}

function risk_profile ($i, $f) {
	$profile = array(
		1 => array(0,19,20,21,24,25),
		2 => array(0,12,13,15,22,23),
		3 => array(0, 7, 8, 9,14,18),
		4 => array(0, 3, 4, 6,11,17),
		5 => array(0, 1, 2, 5,10,16)
	);
	return $profile[$f][$i];
}

function gen_riskprofile_url($pid, $current_id) {
	global $connect;
	$sql1="SELECT * FROM csa WHERE csa_id ='$pid' ";	
	$result1=mysqli_query($connect, $sql1);	
	$i=0;
	$data = '';
	while ($row1 = mysqli_fetch_array($result1)) {	
		//$ch = chr(65+$i);
		$ch = $row1['label'];
		if ($row1['frequency']>0 && $row1['impact']>0) {
			$s = risk_profile($row1['frequency'],6-$row1['impact']);
			if ($current_id==$ch) { 
				$data.=$ch.'.'.str_repeat('0', 2-strlen($s)).$s.'1'.'_';
			} else {
				$data.=$ch.'.'.str_repeat('0', 2-strlen($s)).$s.'0'.'_';
			}
		}
		++$i;
	}
	return $data;
}

function htlm2text($h) {
	$h = strip_tags($h);
	//$h = str_replace("\n\n", "\n", $h);
	$h = str_replace("\n", '<br>', $h);
	$h = str_replace(' ', '&nbsp;', $h);
	return $h;
}
?>